基本要求

1. 掌握 Python 语言的基本语法规则。
2. 掌握不少于 2 个基本的 Python 标准库。
3. 掌握不少于 2 个 Python 第三方库，掌握获取并安装第三方库的方法。
4. 能够阅读和分析 Python 程序。
5. 熟练使用 IDLE 开发环境，能够将脚本程序转变为可执行程序。
6. 了解 Python 计算生态在以下方面（不限于）的主要第三方库名称：网络爬虫、数据分析、数
据可视化、机器学习、Web 开发等。

考试内容

一、 Python 语言基本语法元素
1. 程序的基本语法元素：程序的格式框架、缩进、注释、变量、命名、保留字、数据类型、赋值
语句、引用。
2. 基本输入输出函数：input()、evel()、print()。
3. 源程序的书写风格。
4. Python 语言的特点。

二、 基本数据类型

1. 数字类型：整数类型、浮点数类型和复数类型。
2. 数字类型的运算：数值运算操作符、数值运算函数。
3. 字符串类型及格式化：索引、切片、基本的 ｆｏｒｍａｔ（）格式化方法。
4. 字符串类型的操作：字符串操作符、处理函数和处理方法。
5. 类型判断和类型间转换。

三、 程序的控制结构

1. 程序的三种控制结构。
2. 程序的分支结构：单分支结构、二分支结构、多分支结构。
3. 程序的循环结构：遍历循环、无限循环、break 和 continue 循环控制。
4. 程序的异常处理：try-except。

四、 函数和代码复用

1. 函数的定义和使用。
2. 函数的参数传递：可选参数传递、参数名称传递、函数的返回值。
3. 变量的作用域：局部变量和全局变量。

五、 组合数据类型

1. 组合数据类型的基本概念。
2. 列表类型：定义、索引、切片。
3. 列表类型的操作：列表的操作函数、列表的操作方法。
4. 字典类型：定义、索引。
5. 字典类型的操作：字典的操作函数、字典的操作方法。

六、 文件和数据格式化

1. 文件的使用：文件打开、读写和关闭。
2. 数据组织的维度：一维数据和二维数据。
3. 一维数据的处理：表示、存储和处理。
4. 二维数据的处理：表示、存储和处理。
5. 采用 CSV 格式对一二维数据文件的读写。

七、 Python 计算生态

1. 标准库：turtle 库（必选）、random 库（必选） 、time 库（可选）。
2. 基本的 Python 内置函数。
3. 第三方库的获取和安装。
3. 脚本程序转变为可执行程序的第三方库：pyinstaller 库（必选）。
4. 第三方库：jieba 库（必选）、wordcloud 库（可选）。
5. 更广泛的 Python 计算生态，只要求了解第三方库的名称，不限于以下领域：网络爬虫、数
据分析、文本处理、数据可视化、用户图形界面、机器学习、Web 开发、游戏开发等。

考试方式

上机考试，考试时长 120 分钟，满分 100 分。
1. 题型及分值
单项选择题 40 分（含公共基础知识部分 10 分）。
操作题 60 分（包括基本编程题和综合编程题）。
2. 考试环境
windows7 操作系统，建议 Python 3.4.2 至 Python 3.5.3 版本，IDLE 开发环境。


https://blog.csdn.net/u014044812/article/details/88642003